tap "homebrew/cask"

brew 'ack'
brew 'autojump'
brew 'wget'
brew 'curl'
brew 'diff-so-fancy'
brew 'git'
brew 'autoconf'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'libpng'
brew 'jpeg'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'libssh'
brew 'bat'
brew 'prettyping'
brew 'fzf'
brew 'cmake'
brew 'coreutils'

cask 'tableplus'
cask 'firefox'
cask '1password'
cask 'cleanmymac'
cask 'dash'
cask 'fantastical'
cask 'insomnia'
cask 'iterm2'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'spotify'
cask 'sublime-text-dev'
cask 'sublime-text-dev'
